app/views/casinos/index.html.erb

SELECT "bids".* FROM "bids" WHERE (close_at < '2014-09-22' and status = 'Active')
SELECT COUNT(*) FROM "bids" INNER JOIN "bids_casinos" ON "bids"."id" = "bids_casinos"."bid_id" WHERE "bids_casinos"."casino_id" = $1  [["casino_id", 1]]
---
					<td><%= casino.casino_market%></td>
					<td><%= casino.bids.count %></td>