app/views/bids/browse_casinos.html.erb

					<td><%= casino.casino_market%></td>
					<td><%= casino.bids.count %></td>
---
SELECT "bids".* FROM "bids" WHERE (close_at < '2014-09-24' and status = 'Active')
SELECT COUNT(*) FROM "bids" INNER JOIN "bids_casinos" ON "bids"."id" = "bids_casinos"."bid_id" WHERE "bids_casinos"."casino_id" = $1  [["casino_id", 1]]


	$(document).ready(function(){
		function loadCasinos(){
			$("#bid_name").html(formObj["bid[bid_name]"]);
			for(var i=0; i < formObj["casinos[]"].length; i++){
				if(formObj["casinos[]"][i] != ""){
					$(".casino-item" + i).find(".casino-name").html((i + 1) + ". " + formObj.casino_names[i]);
				}else{
					$(".casino-item" + i).find(".casino-name").html((i + 1) + ". (None)");
				}
			}

			$.removeCookie("temp_bid", { path: '/' });
			$.cookie("temp_bid", JSON.stringify(formObj), { path: '/' });
		}

		loadCasinos();

		$(".casino-add2bid-link").click(function(e){
			e.preventDefault();
			var casino_id = $(this).data("casino-id");
			var casino_name = $(this).data("casino-name");
---
SELECT "casinos".* FROM "casinos" ORDER BY lower(casino_name)
SELECT COUNT(DISTINCT "casinos"."id") AS count_id, casino_market AS casino_market FROM "casinos" LEFT OUTER JOIN "users" ON "users"."id" = "casinos"."user_id" WHERE (users.status='active') GROUP BY casino_market ORDER BY casino_market