app/views/bids/browse_markets.html.erb

SELECT "bids".* FROM "bids" WHERE (close_at < '2014-09-22' and status = 'Active')
---
					<td><%= casino.casino_market%></td>
					<td><%= casino.bids.count %></td>

SELECT "casinos".* FROM "casinos" ORDER BY lower(casino_name)
---

	$(document).ready(function(){
		var markets_with_count = {};
		<% @casino_markets.each do |market| %>
			<% if @markets_with_count[market] %>
				markets_with_count["<%= market %>"] = <%= @markets_with_count[market] %>;
			<% else %>
				markets_with_count["<%= market %>"] = 0;
			<% end %>
		<% end %>

		function loadMarket(){
			$("#bid_name").html(formObj["bid[bid_name]"]);
			if(formObj["bid[market]"] != ""){
				$(".casino-name").html(formObj["bid[market]"]);
				$(".number-of-casinos").html(markets_with_count[formObj["bid[market]"]]);
				$('.btn-select-market').html("You'v selected<br/>" + formObj["bid[market]"]);
				$('.btn-select-market').attr("disabled", true);
			}else{
				$(".casino-name").html("(None)");
				$(".number-of-casinos").html("");
				$('.btn-select-market').html("Select This Market")