app/views/bids/casino_bids.html.erb

SELECT COUNT(*) FROM "offers" WHERE "offers"."bid_id" = $1 AND (casino_id=1 and (offer_status is null or offer_status!='Declined by casino'))  [["bid_id", 1]]
---
							<td><%= bid.by_market ? "Market" : "Select" %></td>
							<td><%= bid.offers.where("offer_status is null or offer_status!=?", "Declined by casino").count %></td>

SELECT "casinos".* FROM "casinos" WHERE "casinos"."user_id" = $1 ORDER BY "casinos"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT COUNT(DISTINCT "casinos"."id") AS count_id, casino_market AS casino_market FROM "casinos" LEFT OUTER JOIN "users" ON "users"."id" = "casinos"."user_id" WHERE (users.status='active') GROUP BY casino_market ORDER BY casino_market
---
							<td>
								<% if bid.offers.where("casino_id=?", current_user.casino.id).count == 0  %>