app/views/bids/history.html.erb

SELECT "bids".* FROM "bids" WHERE (user_id = 1 and close_at >= '2014-09-22') ORDER BY "bids"."id" ASC LIMIT 1
---
<% current_bid = Bid.first :conditions => ["user_id = ? and close_at >= ?", current_user.id, Date.today.to_s] %>