app/controllers/bids_controller.rb

  def new
    @bid = Bid.first :conditions => ["user_id = ? and (status = ? or status = ? or status = ?)", current_user.id, "Active", "Accepted", "Responed"]
    if not @bid.nil? # and @bid.offers.where('offer_status is null or offer_status != ?','Declined by casino').count == 0
      flash[:notice_type] = "danger"
      flash[:notice] = "*You currently have a bid with offers awaiting your response. You can not create a new bid until you cancel your open bid or accept a offer.<br/>
                        Would you like to manage your offers? <a href='#{current_bids_path}'>Yes</a> / <a href='#{history_bids_path}'>No</a>"
      # redirect_to(action: 'history')
    else
      @bid = Bid.new
    end
    @casinos = Casino.find :all, :conditions => ["users.status = ?", 'active'], :include => :user
---
SELECT "bids".* FROM "bids" WHERE (user_id = 1 and (status = 'Active' or status = 'Accepted' or status = 'Responed')) ORDER BY "bids"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

  def browse_markets
    if params[:casino_id]
      @casino = Casino.find(params[:casino_id])
      render "markets_casino_details"
    else

      @casinos = Casino.order("lower(casino_name)")
---
SELECT "casinos".* FROM "casinos" ORDER BY lower(casino_name)

  def browse_casinos
    if params[:casino_id]
      @casino = Casino.find(params[:casino_id])
      render "casinos_casino_details"
    else
      @casinos = Casino.order("lower(casino_name)")
---
SELECT "casinos".* FROM "casinos" ORDER BY lower(casino_name)

  def create
    @bid = Bid.new(bid_params)
    if @bid.by_market
      Casino.where("casino_market=?", @bid.market).each do |casino|
        @bid.casinos << casino
      end
    else
      params[:casinos].each do |casino_id|
        if casino_id != ""
          @bid.casinos << Casino.find(casino_id.to_i)
---
SELECT "bids".* FROM "bids" WHERE (close_at < '2014-09-24' and status = 'Active')
INSERT INTO "bids" ("adults", "arrival_date", "bid_fee", "bid_fee_reimbursement", "bid_name", "by_market", "children", "close_at", "created_at", "departure_date", "market", "player_category", "preference_accomodations", "preference_accomodations_level", "preference_dining", "preference_dining_level", "preference_entertainment", "preference_entertainment_level", "preference_gaming", "preference_gaming_level", "preference_other", "preference_other_level", "preference_transportation", "preference_transportation_level", "reference_number", "updated_at", "user_id", "wager_level") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28) RETURNING "id"
INSERT INTO "bids_casinos" ("bid_id", "casino_id") VALUES (1, 1)
SELECT "casinos".* FROM "casinos" WHERE "casinos"."id" = $1 LIMIT 1  [["id", 1]]

  def current
    @bid = Bid.where('user_id = ? and status in (?)', current_user.id, %w[Active Accepted Responsed]).first
---
SELECT "bids".* FROM "bids" WHERE (user_id = 1 and status in ('Active','Accepted','Responsed')) ORDER BY "bids"."id" ASC LIMIT 1

  def history
    @bids = Bid.find :all, :conditions => ["user_id = ?", current_user.id]
---
SELECT "bids".* FROM "bids" WHERE (user_id = 1 and close_at >= '2014-09-22') ORDER BY "bids"."id" ASC LIMIT 1

  def casino_bids
    @casino = current_user.casino
    @open_bids = []
    @closed_bids = []

    @casino.bids.each do |bid|
      if bid.status == "Active"
        @open_bids << bid if bid.offers.where("casino_id=? and (offer_status is null or offer_status!=?)", @casino.id, "Declined by casino").count == 0
---
SELECT "bids".* FROM "bids" INNER JOIN "bids_casinos" ON "bids"."id" = "bids_casinos"."bid_id" WHERE "bids_casinos"."casino_id" = $1  [["casino_id", 1]]
SELECT "casinos".* FROM "casinos" WHERE "casinos"."user_id" = $1 ORDER BY "casinos"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT COUNT(*) FROM "offers" WHERE "offers"."bid_id" = $1 AND (casino_id=1 and (offer_status is null or offer_status!='Declined by casino'))  [["bid_id", 1]]
SELECT COUNT(DISTINCT "casinos"."id") AS count_id, casino_market AS casino_market FROM "casinos" LEFT OUTER JOIN "users" ON "users"."id" = "casinos"."user_id" WHERE (users.status='active') GROUP BY casino_market ORDER BY casino_market