app/controllers/casinos_controller.rb

SELECT "casinos".* FROM "casinos" ORDER BY lower(casino_name)
---
  def index
    @casinos = Casino.order("lower(casino_name)")