app/controllers/offers_controller.rb

SELECT "casinos".* FROM "casinos" WHERE "casinos"."user_id" = $1 ORDER BY "casinos"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT "offers".* FROM "offers" WHERE "offers"."casino_id" = $1  [["casino_id", 1]]
---
  def index
    @open_offers = []
    @closed_offers = []
    offers = current_user.casino.offers
    offers.each do |offer|