app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'casino1@gmail.com' ORDER BY "users"."id" ASC LIMIT 1
---
	def create
		user = User.find_for_database_authentication(email: params[:user][:email])